### Exploratory data analyses:

To understand the data and their distribution. How can we help with vendor profitablity?

In [1]:
'''import necessary libraries'''
import pandas as pd
import sqlite3

In [2]:
conn = sqlite3.connect('vendor_performance.db')

In [3]:
tables = pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table';", conn)
print(tables)

              name
0  begin_inventory
1    end_inventory
2        purchases
3  purchase_prices
4            sales
5   vendor_invoice

In [4]:
for i in tables['name']:
    query = f"SELECT COUNT(*) AS total_rows FROM {i};"
    total_rows = pd.read_sql(query, conn)
    print(f"{i}: table has {total_rows['total_rows'][0]} rows")
    print('-'*40)
    display(pd.read_sql(f"SELECT * FROM {i} LIMIT 5;", conn))

begin_inventory: table has 206529 rows
----------------------------------------

,InventoryId,Store,City,Brand,Description,Size,onHand,Price,startDate
0,1_HARDERSFIELD_58,1,HARDERSFIELD,58,Gekkeikan Black & Gold Sake,750mL,8,12.99,2024-01-01
1,1_HARDERSFIELD_60,1,HARDERSFIELD,60,Canadian Club 1858 VAP,750mL,7,10.99,2024-01-01
2,1_HARDERSFIELD_62,1,HARDERSFIELD,62,Herradura Silver Tequila,750mL,6,36.99,2024-01-01
3,1_HARDERSFIELD_63,1,HARDERSFIELD,63,Herradura Reposado Tequila,750mL,3,38.99,2024-01-01
4,1_HARDERSFIELD_72,1,HARDERSFIELD,72,No. 3 London Dry Gin,750mL,6,34.99,2024-01-01

end_inventory: table has 224489 rows
----------------------------------------

,InventoryId,Store,City,Brand,Description,Size,onHand,Price,endDate
0,1_HARDERSFIELD_58,1,HARDERSFIELD,58,Gekkeikan Black & Gold Sake,750mL,11,12.99,2024-12-31
1,1_HARDERSFIELD_62,1,HARDERSFIELD,62,Herradura Silver Tequila,750mL,7,36.99,2024-12-31
2,1_HARDERSFIELD_63,1,HARDERSFIELD,63,Herradura Reposado Tequila,750mL,7,38.99,2024-12-31
3,1_HARDERSFIELD_72,1,HARDERSFIELD,72,No. 3 London Dry Gin,750mL,4,34.99,2024-12-31
4,1_HARDERSFIELD_75,1,HARDERSFIELD,75,Three Olives Tomato Vodka,750mL,7,14.99,2024-12-31

purchases: table has 2372474 rows
----------------------------------------

,InventoryId,Store,Brand,Description,Size,VendorNumber,VendorName,PONumber,PODate,ReceivingDate,InvoiceDate,PayDate,PurchasePrice,Quantity,Dollars,Classification
0,69_MOUNTMEND_8412,69,8412,Tequila Ocho Plata Fresno,750mL,105,ALTAMAR BRANDS LLC,8124,2023-12-21,2024-01-02,2024-01-04,2024-02-16,35.71,6,214.26,1
1,30_CULCHETH_5255,30,5255,TGI Fridays Ultimte Mudslide,1.75L,4466,AMERICAN VINTAGE BEVERAGE,8137,2023-12-22,2024-01-01,2024-01-07,2024-02-21,9.35,4,37.40,1
2,34_PITMERDEN_5215,34,5215,TGI Fridays Long Island Iced,1.75L,4466,AMERICAN VINTAGE BEVERAGE,8137,2023-12-22,2024-01-02,2024-01-07,2024-02-21,9.41,5,47.05,1
3,1_HARDERSFIELD_5255,1,5255,TGI Fridays Ultimte Mudslide,1.75L,4466,AMERICAN VINTAGE BEVERAGE,8137,2023-12-22,2024-01-01,2024-01-07,2024-02-21,9.35,6,56.10,1
4,76_DONCASTER_2034,76,2034,Glendalough Double Barrel,750mL,388,ATLANTIC IMPORTING COMPANY,8169,2023-12-24,2024-01-02,2024-01-09,2024-02-16,21.32,5,106.60,1

purchase_prices: table has 12261 rows
----------------------------------------

,Brand,Description,Price,Size,Volume,Classification,PurchasePrice,VendorNumber,VendorName
0,58,Gekkeikan Black & Gold Sake,12.99,750mL,750,1,9.28,8320,SHAW ROSS INT L IMP LTD
1,62,Herradura Silver Tequila,36.99,750mL,750,1,28.67,1128,BROWN-FORMAN CORP
2,63,Herradura Reposado Tequila,38.99,750mL,750,1,30.46,1128,BROWN-FORMAN CORP
3,72,No. 3 London Dry Gin,34.99,750mL,750,1,26.11,9165,ULTRA BEVERAGE COMPANY LLP
4,75,Three Olives Tomato Vodka,14.99,750mL,750,1,10.94,7245,PROXIMO SPIRITS INC.

sales: table has 12825363 rows
----------------------------------------

,InventoryId,Store,Brand,Description,Size,SalesQuantity,SalesDollars,SalesPrice,SalesDate,Volume,Classification,ExciseTax,VendorNo,VendorName
0,1_HARDERSFIELD_1004,1,1004,Jim Beam w/2 Rocks Glasses,750mL,1,16.49,16.49,2024-01-01,750.0,1,0.79,12546,JIM BEAM BRANDS COMPANY
1,1_HARDERSFIELD_1004,1,1004,Jim Beam w/2 Rocks Glasses,750mL,2,32.98,16.49,2024-01-02,750.0,1,1.57,12546,JIM BEAM BRANDS COMPANY
2,1_HARDERSFIELD_1004,1,1004,Jim Beam w/2 Rocks Glasses,750mL,1,16.49,16.49,2024-01-03,750.0,1,0.79,12546,JIM BEAM BRANDS COMPANY
3,1_HARDERSFIELD_1004,1,1004,Jim Beam w/2 Rocks Glasses,750mL,1,14.49,14.49,2024-01-08,750.0,1,0.79,12546,JIM BEAM BRANDS COMPANY
4,1_HARDERSFIELD_1005,1,1005,Maker's Mark Combo Pack,375mL 2 Pk,2,69.98,34.99,2024-01-09,375.0,1,0.79,12546,JIM BEAM BRANDS COMPANY

vendor_invoice: table has 5543 rows
----------------------------------------

,VendorNumber,VendorName,InvoiceDate,PONumber,PODate,PayDate,Quantity,Dollars,Freight,Approval
0,105,ALTAMAR BRANDS LLC,2024-01-04,8124,2023-12-21,2024-02-16,6,214.26,3.47,None
1,4466,AMERICAN VINTAGE BEVERAGE,2024-01-07,8137,2023-12-22,2024-02-21,15,140.55,8.57,None
2,388,ATLANTIC IMPORTING COMPANY,2024-01-09,8169,2023-12-24,2024-02-16,5,106.60,4.61,None
3,480,BACARDI USA INC,2024-01-12,8106,2023-12-20,2024-02-05,10100,137483.78,2935.20,None
4,516,BANFI PRODUCTS CORP,2024-01-07,8170,2023-12-24,2024-02-12,1935,15527.25,429.20,None

In [5]:
for i in tables['name']:
    print(f"Table: {i}")
    query = f"select * from {i};"
    table = pd.read_sql(query, conn)
    print(table.dtypes)

Table: begin_inventory
InventoryId     object
Store            int64
City            object
Brand            int64
Description     object
Size            object
onHand           int64
Price          float64
startDate       object
dtype: object
Table: end_inventory
InventoryId     object
Store            int64
City            object
Brand            int64
Description     object
Size            object
onHand           int64
Price          float64
endDate         object
dtype: object
Table: purchases
InventoryId        object
Store               int64
Brand               int64
Description        object
Size               object
VendorNumber        int64
VendorName         object
PONumber            int64
PODate             object
ReceivingDate      object
InvoiceDate        object
PayDate            object
PurchasePrice     float64
Quantity            int64
Dollars           float64
Classification      int64
dtype: object
Table: purchase_prices
Brand               int64
Description        object
Price             float64
Size               object
Volume             object
Classification      int64
PurchasePrice     float64
VendorNumber        int64
VendorName         object
dtype: object
Table: sales
InventoryId        object
Store               int64
Brand               int64
Description        object
Size               object
SalesQuantity       int64
SalesDollars      float64
SalesPrice        float64
SalesDate          object
Volume            float64
Classification      int64
ExciseTax         float64
VendorNo            int64
VendorName         object
dtype: object
Table: vendor_invoice
VendorNumber      int64
VendorName       object
InvoiceDate      object
PONumber          int64
PODate           object
PayDate          object
Quantity          int64
Dollars         float64
Freight         float64
Approval         object
dtype: object

In [11]:
## We first try to understand how much quantity of each sale during the reporting perio (by using begin and end inventory table)
query = ''' select 
                  a.store, 
                a.brand,
                a.size,
                SUM(a.onHand) as Begin_Inventory,
                sum(c.quantity) as purchased_quantity,
                sum(d.SalesQuantity) as sold_quantity,
                sum(b.onhand) as End_Inventory,
                avg(a.price) as begin_price,
                avg(c.PurchasePrice) as purchased_price,
                avg(d.SalesPrice) as sold_price,
                avg(b.price) as end_price
          from Begin_Inventory as a
          left join End_Inventory b
          on a.InventoryId = b.InventoryId
          left join Purchases as c
          on a.InventoryId = c.InventoryId
          left join Sales as d
          on a.InventoryId = d.InventoryId
          where a.brand is not null or b.brand is not null or c.brand is not null or d.brand is not null
          group by b.store, b.brand, b.size;'''

table = pd.read_sql(query, conn)
display(table)

,Store,Brand,Size,Begin_Inventory,purchased_quantity,sold_quantity,End_Inventory,begin_price,purchased_price,sold_price,end_price
0,1,60,750mL,145487973,39351513.0,7868074.0,NaN,15.192297,10.970894,15.133911,NaN
1,1,58,750mL,10080,7350.0,1836.0,13860.0,12.990000,9.280000,12.590000,12.99
2,1,62,750mL,9120,8816.0,2300.0,10640.0,36.990000,28.670000,38.634737,36.99
3,1,63,750mL,1440,2832.0,550.0,3360.0,38.990000,30.460000,40.656667,38.99
4,1,72,750mL,12,NaN,2.0,8.0,34.990000,NaN,34.990000,34.99
...,...,...,...,...,...,...,...,...,...,...,...
174972,79,46985,750mL,936,1416.0,84.0,3168.0,22.990000,15.750000,23.948333,23.99
174973,79,47014,750mL,1131,1044.0,120.0,783.0,13.990000,8.160000,13.783103,13.99
174974,79,47090,750mL,3610,2280.0,325.0,2660.0,23.990000,15.580000,23.990000,23.99
174975,79,90011,750mL,24,4.0,5.0,18.0,144.990000,94.760000,144.990000,144.99
174976,79,90089,750mL,24,NaN,3.0,21.0,119.990000,NaN,119.990000,119.99

In [ ]:
table ['']